---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.MultipleSelectNumberIsWrong
source: html/af25d6dc-41d2-922b-4403-a2dc7d2bf0fe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.MultipleSelectNumberIsWrong Property

The selected tree nodes number of system browser is wrong.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultipleSelectNumberIsWrong { get; }
```